Revit 2027 API
SpatialFieldManager.GetRegisteredResults Method
 Returns an array of indices of all registered results
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetRegisteredResults()
Public Function GetRegisteredResults As IList(Of Integer)
public:
IList<int>^ GetRegisteredResults()
member GetRegisteredResults : unit -> IList<int>
Return Value
IList<Int32>
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace